FISH_FISH = {
    2303: "装甲洞穴鱼", 2299: "大西洋鳕鱼", 2290: "鲈鱼", 2436: "蓝水母", 2317: "混沌鱼",
    2305: "猩红虎鱼", 2304: "雀鲷", 2313: "双鳍鳕鱼", 2318: "黑檀锦鲤", 2312: "闪鳍锦鲤",
    4401: "偏口鱼", 2306: "寒霜鲦鱼", 2308: "金鲤鱼", 2437: "绿水母", 2319: "血腥食人鱼",
    2314: "蜂蜜鱼", 2302: "霓虹脂鲤", 2315: "黑曜石鱼", 2438: "粉水母", 2307: "公主鱼",
    2310: "七彩矿鱼", 2301: "红鲷鱼", 4402: "岩石龙虾", 2298: "三文鱼", 2316: "虾",
    2309: "镜面鱼", 2321: "臭味鱼", 2297: "鳟鱼", 2300: "金枪鱼", 2311: "斑驳油鱼"
}

FISH_QUEST = {
    2475: "毒菌鱼", 2476: "天使鱼", 2450: "蝙蝠鱼", 2477: "血腥战神", 2478: "骷髅鱼",
    2451: "大黄蜂金枪鱼", 2479: "兔兔鱼", 2480: "金枪鱼须船长", 2452: "猫鱼", 2453: "云鱼",
    2481: "小丑鱼", 2454: "诅咒鱼", 2482: "恶魔地狱鱼", 2483: "跳跳鱼", 2455: "土鱼",
    2456: "雷管鱼", 2457: "浮游噬鱼", 2458: "坠落星鱼", 2459: "克苏鲁鱼", 2460: "骷髅王鱼",
    2484: "猪龙鱼", 2472: "向导巫毒鱼", 2461: "鸟妖鱼", 2462: "饿鬼鱼", 2463: "灵液鱼",
    2485: "染病鞘鱼", 2464: "珠宝鱼", 2465: "幻象鱼", 2486: "泥鱼", 2466: "突变雪怪鱼",
    2467: "企鹅鱼", 2468: "妖精鱼", 4393: "甲虫鱼", 4394: "蝎子鱼", 2487: "史莱姆鱼",
    2469: "蜘蛛鱼", 2488: "热带梭鱼", 2470: "苔原鳟鱼", 2471: "独角兽鱼", 2473: "飞龙尾", 2474: "僵尸鱼"
}

FISH_USABLE_ITEMS = {
    2423: "蛙腿", 3225: "气球河豚鱼", 3196: "炸弹鱼", 2330: "紫挥棒鱼", 2341: "掠夺鲨",
    2320: "岩鱼锤", 2342: "锯齿鲨", 3197: "寒霜飞鱼", 2332: "剑鱼", 2420: "和风鱼",
    3210: "毒弹枪", 3211: "舌锋剑", 3209: "水晶蛇", 2429: "带鳞松露", 2331: "黑曜石剑鱼",
    3000: "炼药桌", 4410: "牡蛎", 4382: "先进战斗技术", 4820: "无底熔岩桶", 4872: "熔岩吸收绵",
    4819: "恶魔海螺", 5240: "红海恐惧", 5274: "湖中女士"
}

FISH_CRATES = {
    2334: "木匣", 2335: "铁匣", 2336: "金匣", 3208: "丛林匣", 3206: "天空匣",
    3203: "腐化匣", 3204: "猩红匣", 3207: "神圣匣", 3205: "地牢匣", 4405: "冰冻匣",
    4407: "绿洲匣", 4877: "黑曜石匣", 5002: "海洋匣", 3979: "珍珠木匣", 3980: "秘银匣",
    3981: "钛金匣", 3987: "荆棘匣", 3985: "天蓝匣", 3982: "污损匣", 3983: "血匣",
    3986: "天赐匣", 3984: "围栏匣", 4406: "针叶木匣", 4408: "幻象匣", 4878: "狱石匣", 5003: "海边匣"
}

FISH_JUNK = {
    2337: "旧鞋", 2338: "海草", 2339: "锡罐", 5275: "Joja可乐"
}

MASTER_FISH_LIST = {**FISH_FISH, **FISH_QUEST, **FISH_USABLE_ITEMS, **FISH_CRATES, **FISH_JUNK}